{
  "_id": "ObjectId(59f82d04200a35c473de4853)",
  "type": 1,
  "parent": 1,
  "title": "HTML5-CSS3",
  "from": "原创",
  "time": "2017-10-25 10:00",
  "img": "http://img2.niutuku.com/desk/1208/1510/ntk-1510-24060.jpg",
  "desc": "“移动端H5页面设计”赛项共分作品提交、现场答辩两个阶段，比赛要求学生利用HTML5-CSS3技术进行开发，需要选手设计开发5～15屏页面，兼容手机竖屏浏览，作品可在iOS和Android操作系统移动终端设备上运行。 谈到参加这次比赛",
  "content": "我小时候在乌孙山下的农一连生活了将近7年，那里的山山水水、树木房屋目前早已是面目全非了，但童年的纯朴记忆却是如此的深刻而亲切，仿佛我一直未曾离开过那里，时不时勾起我内心朴素、温暖、淡远的回忆。\n记得有一年的八月份，我和连队的六七个小孩坐驴车到生产队收完西瓜的大田地里捡遗漏的西瓜。驴车在石头路上颠得我们前仰后合，浑身不舒服，感觉上有点新奇、刺激。大概过了二队路口有一公里远路的时候，不知是什么原因把驴车给惊了。毛驴不顾一切发疯得狂奔起来，刚开始50米把我们在车上像筛豆子一样上下狂颠，吓得我大气不敢出，紧紧抓住车帮子。等驴车全然不顾路上的大石头、土坑、土包什么的一口气跑到七八十米的地方，车上早已空无一人，大家全部被颠出去摔倒了路上，有的小孩甚至翻进了渠沟，脸上身上不是灰土就是泥巴，个个狼狈不堪。在100多米远的地方驴车翻到渠沟里，卡在几棵杨树的中间不动了。赶车的大孩子追上车，叫了路上的几个人帮忙费劲地把驴车勉强拖出了渠沟。惊魂未定的我们说什么也不敢再坐驴车了。我们沿路旁的树林小路中走了2公里，远远看到有各家的大人们弯腰在地里找寻西瓜。我们赶紧冲到地里，找到大人拳头大小的西瓜用力在地上磕开，里面的瓜瓤无论红瓤、还是黄瓤基本上都熟了。吃完瓜我顺手用西瓜水洗了把脸，感觉好爽。大人们一般只找2公斤以上的西瓜，而我找了一个小时也才找到几个半公斤或一公斤左右的西瓜，有点丧气。加上太阳毒辣辣的，越发得感觉疲乏没劲头。就在我不抱希望的时候，无意中在渠沟的草丛下居然发现了一个9公斤左右的大西瓜，而且品质十分优良。这下可乐坏了家里人，爸妈赶紧把我和哥集合在一起切了一半瓜再拿出馍馍就餐，还有邻家的两个锡伯族小孩也和我们一起放开怀吃起这个又大又甜的西瓜王。半个西瓜很快就让我们全吃饱了，剩下的带回家晚上慢慢品尝。本来感觉没力气的我因为特别高兴，一下子觉得精神抖擞，走路生风，心花怒放。\n还有一次，我和小伙伴相约跑到连队坡下居住的小胖子家里玩。他家里有很多果树，五月份正是鸟语花香、蜜蜂嗡嗡采蜜的季节。快中午的时候我急急忙忙跑回家准备吃饭，结果迎头和一只大蜜蜂碰了头，而且蜜蜂飞快地在我右眉毛处狠狠蛰了一下，哎呀！疼得我一跳老高。我坚持跑回家后，爸妈想了各种办法给我止痛，但效果均不太理想，关键是蜂刺扎进去深不容易找到。过了一周我被蜜蜂蛰过的地方慢慢减轻了疼痛，但眉头处凸起了一个小黄豆大的疙瘩，一直保留到现在还能清楚地摸到。从那以后，我每当见到蜜蜂嗡嗡飞舞，就会莫名得紧张起来，这都是小时候遗留下的心理恐惧症。\n农一连小学东面紧挨着一条南北方向终年流水的山沟。山沟靠南侧的地势稍微突出且平缓，有条去往县城的石子马路架木桥横穿溪水。有一年夏天农一连为了重修原先不堪重负的木桥，将路面全部挖断后开始做水泥桥墩。在桥的南侧不远临时开了一条便道走车。我经常在大桥工地上看各种车辆来来往往涉水过便道。便道中央有十几公分深、宽2米多的水流持续不断，有时牧民驾马车拉了高高的一大车草料，急速从水流中冲上对面的土路，有点险象环生。因为便道水流的下面垫过厚厚一层石子，所以车辆一般不容易陷进去。有一天，一辆满载乘客前往县城的陈旧班车经过便道时不小心陷入了水坑。司机把乘客赶下车，让年轻有力的乘客帮着推车。忙了一阵车子纹丝不动。有人出主意叫来了大拖拉机用钢丝绳拖车，司机先是往班车车轮下垫上些干树枝，结果大拖拉机开足马力用力来回拖拽班车，拖得有几次车头都跳离地面老高，最终忙了半小时还是差一点力道没把班车拖出水坑。最后，农一连的领导出面叫来了连队耕大田地的东方红链轨拖拉机来拖班车，不到十分钟就轻松拖出了班车，等待已久的乘客们高兴地发出了欢呼声。\n当时我家就住在农一连小学对面，门口有一家经常有人繁忙劳作的铁匠铺。尤其是夏天铁匠铺里叮叮当当地有壮汉用力抡锤打制农具，看上去火花四溅。有时他们也给牧民们的马蹄钉马掌子。有一次，一个几岁不懂事的哈族小男孩悄悄脱离了大人的看护，走到马后面抱马腿玩，结果马一尥蹶子把他踢出去几米远，造成了重伤。铁匠铺门前的清清水渠旁种了很多榆树和白杨树，夏天是大人们乘凉聊天的好场所。有一次两个牧民先后来到铁匠铺前，顺手把马和一头毛驴拴在两棵靠得很近的榆树树身上，而且绳子挽得短。结果半小时后，马张口把旁边的毛驴脸上咬了很多口子，我看到后感到又可笑又害怕，没想到看上去不吭不哈的马有时候脾气暴躁得会用嘴咬的方式欺负毛驴。\n父亲当时在农一连小学担任校长。全校也就200多名学生，但校舍有点紧张。父亲和学校后勤主任关向东老师（锡伯族）商议后召集了全校男老师自己动手备料、出工，花了一个暑假的时间盖起了五件新教室，为农一连的各族子弟求学做出了显著贡献，受到了连队群众的广泛赞誉。我印象中的第一张黑白全家福照片就是在农一连小学校园里的果树下拍照的，表情非常呆板都不知道露个笑容。我在农一连小学上一年级时最喜欢音乐课，几个班的学生合在一间最大的教室里集体学唱歌，个个嗓门洪亮，兴致勃勃。我当时快7岁了，我的同桌是个14岁的哈族女孩，她上学很晚，而且功课也不太好，同学们都不喜欢和她玩耍（年龄差距太大也是一个因素）。我清楚记得她有时候爱偷偷抓泥土吃，后来听说她因此得病去住院开刀治疗了。\n我七岁一年级学期快结束的前一个月随父亲转学到了县城小学，也实实在在地体验了一次农村陈旧线路班车的拥挤和颠簸。现如今，县城去农一连的道路宽敞平整，小车20分钟就能跑到。每当我坐车路过农一连地界时，都会久久凝望铁匠铺（已经消失了）前的一排高大粗壮的老榆树和白杨树。这些伴随我童年成长的老树们依然健硕、伟岸，枝繁叶茂，常有不知名的鸟雀欢唱飞腾于树梢。岁月沧桑巨变，农一连早已旧貌换新颜，但农一连的绵绵、青涩回忆永远是我心中温情、难忘的血脉沟通联系，农一连永远是我心中神圣、不可替代的生命起航地。",
  "read": 156,
  "leavs": [
    {
      "name": "小王",
      "email": "1642@151.ca",
      "content": "我来留言了",
      "time": 1509523308993.0,
      "avatar": "logo.png"
    }
  ],
  "label": [
    "vuejs",
    "javascript",
    "node"
  ]
};

/************** 定义模式articlesSchema **************/
const articlesSchema = new Schema({
"type": Number,
"parent": Number,
"title": String,
"img": String,
"from": String,
"time": String,
"desc": String,
"content": String,
"read": Number,
"leavs": [
new Schema({
"name": String,
"email": String,
"content": String,
"time": String,
"avatar": String
})
],
"label": Array
});


{
"_id": "ObjectId(59eff3327cf624053f3c6126)",
"src": "http://img2.niutuku.com/desk/1208/1510/ntk-1510-24060.jpg",
"title": "标题",
"describe": "描述信息"
}

